/*******************************************************************************
*                 
*                 		       普中科技
--------------------------------------------------------------------------------
* 实 验 名		 : LCD-FSMC实验
* 实验说明       : 通过JLINK将程序下载进去后点击复位，彩屏上面显示hell world！
					LED指示灯闪烁效果，按下复位开关重新运行
* 连接方式       : 
* 注    意		 : 	所用函数在头文件.c文件内
*******************************************************************************/
#include "string.h"
#include "stdlib.h"
#include "public.h"
#include "gui.h"
#include "led.h"


extern int EncodeData(int nLevel, int nVersion, unsigned char bAutoExtent, int nMaskingNo, unsigned char* lpsSource, int ncSource);
unsigned char encode_version = 0;


uint8_t darcode[21][21] = {
{1,1,1,1,1,1,1,0,0,1,0,1,0,0,1,1,1,1,1,1,1},
{1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1},
{1,0,1,1,1,0,1,0,1,0,0,0,1,0,1,0,1,1,1,0,1},
{1,0,1,1,1,0,1,0,0,1,1,0,1,0,1,0,1,1,1,0,1},
{1,0,1,1,1,0,1,0,1,0,1,0,0,0,1,0,1,1,1,0,1},
{1,0,0,0,0,0,1,0,1,1,1,0,1,0,1,0,0,0,0,0,1},
{1,1,1,1,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,1,1},
{0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0},
{1,0,0,1,0,0,1,0,1,0,1,1,0,1,0,1,1,0,1,0,0}, 
{0,1,1,0,0,1,0,0,1,0,0,1,0,1,0,1,0,0,1,0,0},
{0,1,0,0,0,0,1,1,1,1,0,0,0,0,1,1,0,1,0,0,1},
{1,0,0,1,1,1,0,0,1,1,1,0,0,1,0,1,1,1,0,1,1}, 
{0,0,0,1,0,0,1,1,0,0,1,0,0,1,1,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0,1,1,0,0,0,1,1,0,1,1,0,1,0},
{1,1,1,1,1,1,1,0,0,0,1,1,0,1,1,1,1,0,1,0,0}, 
{1,0,0,0,0,0,1,0,0,1,1,1,1,0,0,0,0,1,1,1,1},
{1,0,1,1,1,0,1,0,0,0,0,1,0,0,1,0,1,0,0,1,0},
{1,0,1,1,1,0,1,0,1,0,1,0,0,0,0,1,1,1,0,1,0},  
{1,0,1,1,1,0,1,0,0,0,1,0,0,0,0,0,1,1,1,0,1},
{1,0,0,0,0,0,1,0,0,1,1,1,0,1,0,1,0,1,0,0,0},
{1,1,1,1,1,1,1,0,1,0,0,0,1,0,1,1,1,0,1,0,1},
};

void GUI_DisplayInit(void)
{
	GUI_ShowPicture(0, 0, 240, 240);  
}

/****************************************************************************
* Function Name  : main
* Description    : Main program.
* Input          : None
* Output         : None
* Return         : None
****************************************************************************/
int main(void)
{
    unsigned char uctest[] = {"12345abch你好//...>"};
    int srclen = 0;
    unsigned char region = 0;
    
    TFT_Init();	  //TFT彩屏初始化
    LED_Init();	 //LED初始化
	TFT_ClearScreen(WHITE);	 //清屏
	//GUI_Show12ASCII(80,130,"hello world!",YELLOW,BLACK);
    //GUI_DisplayInit();            
    
    srclen = strlen(uctest);
    if(EncodeData(3, 0, 1, -1, uctest, srclen));
    {
        GUI_Show12ASCII(80,220,"hello world!",YELLOW,BLACK);  
    }
    
    region = (encode_version-1)*4+21;
    Drow_darcode(10, 10, region);
    
	while(1)
	{
		led_display();	//LED闪烁			
	}
}
